

#   2.За следващата задача трябва да направите filter програмка – програмка, която да изтрива
#   празните места (whitespace) в един документ. Давате стринг от рода на:
#   „ 9C 01 00 5F 2A 02 07 52 C3 01 00 9F 02 06 00 00 00 00 20 00 9A 03 17 03 24 9F 21 03 12 05 24“
# 	връщате:
# 	„9C01005F2A020752C301009F02060000000020009A031703249F2103120524“
# 	По отношение на нов ред → може да сложите опция на програмата, дали да го маха или не.

example_string =  "9C 01 00 5F  2A 02 07 52 C3 01 00 9F 02 06 00 00 00 00 20 00 9A 03 17 03 24 9F 21 03 12 05 24
              
              
     00 00 00 00 20 00 9A 03 17 03 24 9F 21 03 12 05 24"

 puts example_string.gsub(/\s+/,"").strip